ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/SPL/MDR32FxQI/src/MDR32FxQI_eth.c
/**
  ******************************************************************************
  * @file    MDR32FxQI_eth.c
  * @author  Milandr Application Team
  * @version V2.0.2i
  * @date    17/03/2022
  * @brief   This file contains all the ETHERNET firmware functions.
  ******************************************************************************
  * <br><br>
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, MILANDR SHALL NOT BE HELD LIABLE FOR ANY DIRECT, INDIRECT
  * OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2022 Milandr</center></h2>
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "MDR32FxQI_dma.h"
#include "MDR32FxQI_eth.h"
#include "MDR32FxQI_rst_clk.h"

#include <math.h>
#include <stdio.h>

/** @addtogroup __MDR32FxQI_StdPeriph_Driver MDR32FxQI Standard Peripherial Driver
  * @{
  */

#if defined (USE_MDR32F1QI)
/** @defgroup ETHERNET ETHERNET
 *  @warning This module can be used only for MCU MDR32F1QI.
  * @{
  */

/** @defgroup ETH_Exported_Variables ETH Exported Variables
 *  @{
 */
extern DMA_CtrlDataTypeDef DMA_ControlTable[DMA_Channels_Number * (1 + DMA_AlternateData)];
/** @} */ /* End of group ETH_Exported_Variables */

/** @defgroup ETH_Private_Defines ETH Private Defines
  * @{
  */


#define IS_ETH_ALL_PERIPH(PERIPH)       (PERIPH == MDR_ETHERNET1)


#define IS_ETH_PHY_ADDRESS(ADDRESS)     (((ADDRESS << ETH_PHY_CONTROL_PHYADD_Pos) & (~ETH_PHY_CONTROL_PHYADD_Msk)) == 0)
#define IS_ETH_COL_WND(WND)             (WND <= 0xFF)
#define IS_ETH_RETRY_COUNTER(COUNTER)   (COUNTER <= 0x0F)
#define IS_ETH_DELIMITER(DELIMITER)     ((DELIMITER >= 0x5EA) && (DELIMITER <= 0x1A16))

#define ETH_BUFFER_SIZE                 ((uint32_t)0x2000)

/** @} */ /* End of group ETH_Private_Defines */


/** @defgroup ETH_Private_Functions ETH Private Functions
  * @{
  */

/**
  * @brief  Reset the ETHERNET clock registers to their default reset values.
  * @param  None
  * @retval None
  */
void ETH_ClockDeInit(void)
{
    uint32_t tmpreg_ETH_CLOCK;

    /* Read old value */
    tmpreg_ETH_CLOCK = MDR_RST_CLK->ETH_CLOCK;

    /* Reset all settings for Ethernet and PHY */
    tmpreg_ETH_CLOCK &= ~(RST_CLK_ETH_CLOCK_PHY_CLK_SEL_Msk
                        | RST_CLK_ETH_CLOCK_ETH2_CLK_EN
                        | RST_CLK_ETH_CLOCK_PHY_CLK_EN
                        | RST_CLK_ETH_CLOCK_ETH_CLK_EN
                        | RST_CLK_ETH_CLOCK_ETH_BRG_Msk
                        | RST_CLK_ETH_CLOCK_PHY_BRG_Msk);

    /* Save new value */
    MDR_RST_CLK->ETH_CLOCK = tmpreg_ETH_CLOCK;
}

/**
  * @brief  Configures the PHY clock register.
  * @param  clock_source - @ref ETH_Clock_Source - defines the frequency source for the PHY.
  * @param  PHY_HCLKdiv - @ref ETH_PHY_Clock_HCLKdiv - specifies the HCLK division factor.
  * @retval None
  */
void ETH_PHY_ClockConfig(ETH_Clock_Source clock_source, ETH_PHY_Clock_HCLKdiv PHY_HCLKdiv)
{
    uint32_t tmpreg_ETH_CLOCK;

    /* Check the parameters */
    assert_param(IS_ETH_CLOCK_SOURCE(clock_source));
    assert_param(IS_ETH_PHY_HCLKdiv(PHY_HCLKdiv));

    tmpreg_ETH_CLOCK = MDR_RST_CLK->ETH_CLOCK;
    tmpreg_ETH_CLOCK &= ~ (RST_CLK_ETH_CLOCK_PHY_BRG_Msk | RST_CLK_ETH_CLOCK_PHY_CLK_SEL_Msk);

    /* Select clock source for PHY module and set PHY DIV */
    tmpreg_ETH_CLOCK |= (uint32_t)clock_source | (uint32_t)PHY_HCLKdiv;
    /* Enable PHY CLK */
    tmpreg_ETH_CLOCK |= RST_CLK_ETH_CLOCK_PHY_CLK_EN;

    MDR_RST_CLK->ETH_CLOCK = tmpreg_ETH_CLOCK;
}

/**
  * @brief  Initializes the ETHERNET peripheral Clock according to the specified parameters.
  * @param  ETH_HCLKdiv - @ref ETH_Clock_BRG - specifies the HCLK division factor.
  * @retval None
  */
void ETH_BRGInit(ETH_Clock_BRG ETH_HCLKdiv)
{
    uint32_t tmpreg_ETH_CLOCK;

    /* Check the parameters */
    assert_param(IS_ETH_CLOCK_BRG(ETH_HCLKdiv));

    tmpreg_ETH_CLOCK = MDR_RST_CLK->ETH_CLOCK;
    tmpreg_ETH_CLOCK &= ~(RST_CLK_ETH_CLOCK_ETH_BRG_Msk);
    tmpreg_ETH_CLOCK |= (uint32_t)ETH_HCLKdiv;

    MDR_RST_CLK->ETH_CLOCK = tmpreg_ETH_CLOCK;
}

/**
  * @brief  Enables or disables the specified ETHERNET clock.
  * @param  ETHx - @ref ETH_Clock_Number - select the number of ETHERNET interface.
  * @param  NewState - @ref FunctionalState - new state of the ETHERNET interface clock.
  * @retval None
  */
void ETH_ClockCMD(ETH_Clock_Number ETHx, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_ETH_CLK(ETHx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if(NewState != DISABLE)
    {
        MDR_RST_CLK->ETH_CLOCK |= (uint32_t)ETHx;
    }
    else
    {
        MDR_RST_CLK->ETH_CLOCK &= ~(uint32_t)ETHx;
    }
}

/**
  * @brief  Reset the ETHERNETx peripheral registers to their default reset values.
  * @param  ETHERNETx: Select the ETHERNET peripheral.
  *         This parameter should be MDR_ETHERNET1.
  * @retval None
  */
void ETH_PHY_Reset(MDR_ETHERNET_TypeDef * ETHERNETx)
{
    /* Check the parameters */
    assert_param(IS_ETH_ALL_PERIPH(ETHERNETx));

    /* Reset PHY */
    ETHERNETx->PHY_Control &= ~ETH_PHY_CONTROL_nRST;

    /* Wait until the PHY unit did not come out in the state after a hard reset. */
    while(ETH_GetPHYStatus(ETHERNETx, ETH_PHY_FLAG_READY) != SET);
}

/**
  * @brief  Enables or disables the PHY.
  * @param  ETHERNETx: Select the ETHERNET peripheral.
  *         This parameter should be MDR_ETHERNET1.
  * @param  NewState - @ref FunctionalState - new state of the PHY.
  * @retval None
  */
void ETH_PHYCmd(MDR_ETHERNET_TypeDef * ETHERNETx, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_ETH_ALL_PERIPH(ETHERNETx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if(NewState == ENABLE)
    {
        ETHERNETx->PHY_Control |= ETH_PHY_CONTROL_nRST;
    }
    else
    {
        ETHERNETx->PHY_Control &= ~ETH_PHY_CONTROL_nRST;
    }

