ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/SPL/MDR32FxQI/src/MDR32FxQI_eth.c
    assert_param(IS_FUNCTIONAL_STATE(ETH_InitStruct->ETH_Transmitter_State));
    assert_param(IS_ETH_TRANSMITTER_BE(ETH_InitStruct->ETH_Transmitter_BE));
    assert_param(IS_ETH_TRANSMITTER_BITS_ORDER(ETH_InitStruct->ETH_Transmitter_Bits_Order));
    assert_param(IS_ETH_TRANSMITTER_EVENT_MODE(ETH_InitStruct->ETH_Transmitter_Event_Mode));
    assert_param(IS_FUNCTIONAL_STATE(ETH_InitStruct->ETH_Automatic_Pad_Strip));
    assert_param(IS_FUNCTIONAL_STATE(ETH_InitStruct->ETH_Automatic_Preamble));
    assert_param(IS_FUNCTIONAL_STATE(ETH_InitStruct->ETH_Automatic_CRC_Strip));
    assert_param(IS_FUNCTIONAL_STATE(ETH_InitStruct->ETH_Automatic_IPG));
    assert_param(IS_ETH_RETRY_COUNTER(ETH_InitStruct->ETH_Retry_Counter));

    assert_param(IS_ETH_RECEIVER_BE(ETH_InitStruct->ETH_Receiver_BE));
    assert_param(IS_ETH_RECEIVER_BITS_ORDER(ETH_InitStruct->ETH_Receiver_Bits_Order));
    assert_param(IS_ETH_RECEIVER_EVENT_MODE(ETH_InitStruct->ETH_Receiver_Event_Mode));
    assert_param(IS_FUNCTIONAL_STATE(ETH_InitStruct->ETH_Receive_All_Packets));
    assert_param(IS_FUNCTIONAL_STATE(ETH_InitStruct->ETH_Short_Frames_Reception));
    assert_param(IS_FUNCTIONAL_STATE(ETH_InitStruct->ETH_Long_Frames_Reception));
    assert_param(IS_FUNCTIONAL_STATE(ETH_InitStruct->ETH_Broadcast_Frames_Reception));
    assert_param(IS_FUNCTIONAL_STATE(ETH_InitStruct->ETH_Error_CRC_Frames_Reception));
    assert_param(IS_FUNCTIONAL_STATE(ETH_InitStruct->ETH_Control_Frames_Reception));
    assert_param(IS_FUNCTIONAL_STATE(ETH_InitStruct->ETH_Unicast_Frames_Reception));
    assert_param(IS_FUNCTIONAL_STATE(ETH_InitStruct->ETH_Source_Addr_HASH_Filter));

    /* Set the buffer size of transmitter and receiver */
    ETHERNETx->ETH_Dilimiter = ETH_InitStruct->ETH_Dilimiter;

    /* Config the PHY control register */
    tmpreg_PHY_Control = (ETH_InitStruct->ETH_PHY_Address << ETH_PHY_CONTROL_PHYADD_Pos)
                       | (ETH_InitStruct->ETH_PHY_Mode) | (ETH_InitStruct->ETH_PHY_Interface);
    ETHERNETx->PHY_Control |= tmpreg_PHY_Control;

    /* Config the G_CFGh register */
    tmpreg_G_CFGh = ETH_InitStruct->ETH_DBG_Mode| (ETH_InitStruct->ETH_DBG_XF << ETH_G_CFGh_DBG_XF_EN_Pos) |
                (ETH_InitStruct->ETH_DBG_RF << ETH_G_CFGh_DBG_RF_EN_Pos) | (ETH_InitStruct->ETH_Loopback_Mode << ETH_G_CFGh_DLB_Pos ) |
                (ETH_InitStruct->ETH_Receiver_RST << ETH_G_CFGh_RRST_Pos) | (ETH_InitStruct->ETH_Transmitter_RST << ETH_G_CFGh_XRST_Pos);
    /* Write to ETH_G_CFGh */
    ETHERNETx->ETH_G_CFGh = tmpreg_G_CFGh;

    /* Config the G_CFGl register */
    tmpreg_G_CFGl = (ETH_InitStruct->ETH_Register_CLR    << ETH_G_CFGl_RCLR_EN_Pos)
                  | (ETH_InitStruct->ETH_Buffer_Mode)
                  | (ETH_InitStruct->ETH_Extension_Mode  << ETH_G_CFGl_EXT_EN_Pos)
                  | (ETH_InitStruct->ETH_HalfDuplex_Mode << ETH_G_CFGl_HD_EN_Pos)
                  | (ETH_InitStruct->ETH_DTRM            << ETH_G_CFGl_DTRM_EN_Pos)
                  | (ETH_InitStruct->ETH_Pause           << ETH_G_CFGl_PAUSE_EN_Pos)
                  | (ETH_InitStruct->ETH_ColWnd);
    /* Write to G_CFGl */
    ETHERNETx->ETH_G_CFGl = tmpreg_G_CFGl;

    /* Config the X_CFG register */
    tmpreg_X_CFG = (ETH_InitStruct->ETH_Transmitter_State   << ETH_X_CFG_EN_Pos)
                 | (ETH_InitStruct->ETH_Transmitter_BE)
                 | (ETH_InitStruct->ETH_Transmitter_Bits_Order)
                 | (ETH_InitStruct->ETH_Transmitter_Event_Mode)
                 | (ETH_InitStruct->ETH_Automatic_Pad_Strip << ETH_X_CFG_PAD_EN_Pos)
                 | (ETH_InitStruct->ETH_Automatic_Preamble  << ETH_X_CFG_PRE_EN_Pos)
                 | (ETH_InitStruct->ETH_Automatic_CRC_Strip << ETH_X_CFG_CRC_EN_Pos)
                 | (ETH_InitStruct->ETH_Automatic_IPG       << ETH_X_CFG_IPG_EN_Pos)
                 | (ETH_InitStruct->ETH_Retry_Counter);
    /* Write to X_CFG */
    ETHERNETx->ETH_X_CFG = tmpreg_X_CFG;

    /* Config the R_CFG register */
    tmpreg_R_CFG = (ETH_InitStruct->ETH_Receiver_State << ETH_R_CFG_EN_Pos)
                 | (ETH_InitStruct->ETH_Receiver_BE)
                 | (ETH_InitStruct->ETH_Receiver_Bits_Order)
                 | (ETH_InitStruct->ETH_Receiver_Event_Mode);

    /* Configure the received packets */
    tmpreg_R_CFG |= (ETH_InitStruct->ETH_Short_Frames_Reception   << ETH_R_CFG_LF_EN_Pos)
              |   (ETH_InitStruct->ETH_Long_Frames_Reception      << ETH_R_CFG_LF_EN_Pos)
              |   (ETH_InitStruct->ETH_Broadcast_Frames_Reception << ETH_R_CFG_BCA_EN_Pos)
              |   (ETH_InitStruct->ETH_Error_CRC_Frames_Reception << ETH_R_CFG_EF_EN_Pos)
              |   (ETH_InitStruct->ETH_Control_Frames_Reception   << ETH_R_CFG_CF_EN_Pos)
              |   (ETH_InitStruct->ETH_Unicast_Frames_Reception   << ETH_R_CFG_UCA_EN_Pos)
              |   (ETH_InitStruct->ETH_Source_Addr_HASH_Filter    << ETH_R_CFG_MCA_EN_Pos)
              |   (ETH_InitStruct->ETH_Receive_All_Packets        << ETH_R_CFG_AC_EN_Pos);

    /* Write to R_CFG */
    ETHERNETx->ETH_R_CFG = tmpreg_R_CFG;

    /* Write the MAC address */
    ETHERNETx->ETH_MAC_T = ETH_InitStruct->ETH_MAC_Address[0];
    ETHERNETx->ETH_MAC_M = ETH_InitStruct->ETH_MAC_Address[1];
    ETHERNETx->ETH_MAC_H = ETH_InitStruct->ETH_MAC_Address[2];

    /* Set the hash table */
    ETHERNETx->ETH_HASH0 = ETH_InitStruct->ETH_Hash_Table_Low & 0x0000FFFF;
    ETHERNETx->ETH_HASH1 = (ETH_InitStruct->ETH_Hash_Table_Low & 0xFFFF0000) >> 16;
    ETHERNETx->ETH_HASH2 = ETH_InitStruct->ETH_Hash_Table_High & 0x0000FFFF;
    ETHERNETx->ETH_HASH3 = (ETH_InitStruct->ETH_Hash_Table_High & 0xFFFF0000) >> 16;

    /* Set the pacet interval fo falf duplex mode. */
    ETHERNETx->ETH_IPG = ETH_InitStruct->ETH_IPG;
    /* Set the prescaler increment values for BAG and JitterWnd. */
    ETHERNETx->ETH_PSC = ETH_InitStruct->ETH_PSC;
    /* Set period the following of packages.*/
    ETHERNETx->ETH_BAG = ETH_InitStruct->ETH_BAG;
    /* Set jitter of packets transmitted. */
    ETHERNETx->ETH_JitterWnd = ETH_InitStruct->ETH_JitterWnd;

    if (ETH_InitStruct->ETH_Buffer_Mode == ETH_BUFFER_MODE_FIFO)
    {
        ETH_DMAPrepare();
    }
}

/**
  * @brief  Enables ETH MAC reception/transmission.
  * @param  ETHERNETx: Select the ETHERNET peripheral.
  *         This parameter should be MDR_ETHERNET1.
  * @retval None
  */
void ETH_Start(MDR_ETHERNET_TypeDef * ETHERNETx)
{
    /* Check the parameters */
    assert_param(IS_ETH_ALL_PERIPH(ETHERNETx));

    ETHERNETx->PHY_Control |= ETH_PHY_CONTROL_nRST;
    ETHERNETx->ETH_G_CFGh &= ~(ETH_G_CFGh_RRST | ETH_G_CFGh_XRST);

    /* Enable transmitter */
    ETH_MACTransmissionCmd(ETHERNETx, ENABLE);
    /* Enable receiver */
    ETH_MACReceptionCmd(ETHERNETx, ENABLE);
}

/**
  * @brief  Enables or disables the MAC transmission.
  * @param  ETHERNETx: Select the ETHERNET peripheral.
  *         This parameter should be MDR_ETHERNET1.
  * @param  NewState - @ref FunctionalState - new state of the MAC transmission.
  * @retval None
  */
void ETH_MACTransmissionCmd(MDR_ETHERNET_TypeDef * ETHERNETx, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_ETH_ALL_PERIPH(ETHERNETx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if(NewState != DISABLE)
    {
        ETHERNETx->ETH_X_CFG |= ETH_X_CFG_EN;
    }
    else
    {
        ETHERNETx->ETH_X_CFG &= ~ETH_X_CFG_EN;
    }
}

/**
  * @brief  Enables or disables the MAC reception.
  * @param  ETHERNETx: Select the ETHERNET peripheral.
  *         This parameter should be MDR_ETHERNET1.
  * @param  NewState - @ref FunctionalState - new state of the MAC reception.
  * @retval None
  */
void ETH_MACReceptionCmd(MDR_ETHERNET_TypeDef * ETHERNETx, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_ETH_ALL_PERIPH(ETHERNETx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if(NewState != DISABLE)
    {
        ETHERNETx->ETH_R_CFG |= ETH_R_CFG_EN;
    }
    else
    {
        ETHERNETx->ETH_R_CFG &= ~ETH_R_CFG_EN;
    }
}

/**
  * @brief  Get the ETHERNETx interrupt status register.
  * @param  ETHERNETx: Select the ETHERNET peripheral.
  *         This parameter should be MDR_ETHERNET1.
  * @retval Return the value of the IFR register.
  */
uint16_t ETH_GetMACITStatusRegister(MDR_ETHERNET_TypeDef * ETHERNETx)
{
    /* Check the parameters */
    assert_param(IS_ETH_ALL_PERIPH(ETHERNETx));

    return (ETHERNETx->ETH_IFR);
}

/**
  * @brief  Checks whether the specified ETHERNET MAC IT is occurred or not.
  * @param  ETHERNETx: Select the ETHERNET peripheral.
  *         This parameter should be MDR_ETHERNET1.
  * @param  ETH_MAC_IT: specifies the flag to check.
  *         This parameter can be one of the @ref ETH_IT_Def values.
  * @retval @ref FlagStatus - The state of ETHERNET MAC IT (SET or RESET).
  */
FlagStatus ETH_GetMACITStatus(MDR_ETHERNET_TypeDef * ETHERNETx, uint32_t ETH_MAC_IT)
{
    FlagStatus bitstatus;

    /* Check the parameters */
    assert_param(IS_ETH_ALL_PERIPH(ETHERNETx));
    assert_param(IS_ETH_MAC_IT(ETH_MAC_IT));

    if(ETHERNETx->ETH_IFR & ETH_MAC_IT)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }

    return (bitstatus);
}

/**
  * @brief  Get the MAC STATUS register.
  * @param  ETHERNETx: Select the ETHERNET peripheral.
  *         This parameter should be MDR_ETHERNET1.
  * @retval Return the value of the STATUS register.
  */
uint32_t ETH_GetMACStatusRegister(MDR_ETHERNET_TypeDef * ETHERNETx)
{
    /* Check the parameters */
    assert_param(IS_ETH_ALL_PERIPH(ETHERNETx));

    return (ETHERNETx->ETH_STAT);
}

/**
  * @brief  Checks whether the specified ETHERNET MAC flag is set or not.
  * @param  ETHERNETx: Select the ETHERNET peripheral.
  *         This parameter should be MDR_ETHERNET1.
  * @param  ETH_MAC_FLAG: specifies the flag to check.
  *         This parameter can be one of the @ref ETH_MAC_FLAGx values.
  * @retval @ref FlagStatus - The state of ETHERNET MAC flag (SET or RESET).
  */
FlagStatus ETH_GetFlagStatus(MDR_ETHERNET_TypeDef * ETHERNETx, uint16_t ETH_MAC_FLAG)
{
    FlagStatus bitstatus;

    /* Check the parameters */
    assert_param(IS_ETH_ALL_PERIPH(ETHERNETx));
    assert_param(IS_ETH_MAC_FLAG(ETH_MAC_FLAG));

