ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/SPL/MDR32FxQI/src/MDR32FxQI_eth.c
    if(ETHERNETx->ETH_STAT & ETH_MAC_FLAG)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }

    return (bitstatus);
}

/**
  * @brief  Enables or disables the specified ETHERNET MAC interrupts.
  * @param  ETHERNETx: Select the ETHERNET peripheral.
  *         This parameter should be MDR_ETHERNET1.
  * @param  ETH_MAC_IT: specifies the ETHERNET MAC interrupt sources
  *         to be enabled or disabled.
  *         This parameter can be any combination of the @ref ETH_IT_Def values.
  * @param  NewState - @ref FunctionalState - new state of the ETHERNET interface clock.
  * @retval None
  */
void ETH_MACITConfig(MDR_ETHERNET_TypeDef * ETHERNETx, uint32_t ETH_MAC_IT, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_ETH_ALL_PERIPH(ETHERNETx));
    assert_param(IS_ETH_MAC_IT(ETH_MAC_IT));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if(NewState != DISABLE)
    {
        ETHERNETx->ETH_IMR |= ETH_MAC_IT;
    }
    else
    {
        ETHERNETx->ETH_IMR &= (~ETH_MAC_IT);
    }
}

/**
  * @brief  Configures the selected MAC address.
  * @param  ETHERNETx: Select the ETHERNET peripheral.
  *         This parameter should be MDR_ETHERNET1.
  * @param  MacAddr: Pointer on MAC address buffer data (6 bytes) to configure.
  * @retval None
  */
void ETH_MACAddressConfig(MDR_ETHERNET_TypeDef * ETHERNETx, uint16_t *MacAddr)
{
    /* Check the parameters */
    assert_param(IS_ETH_ALL_PERIPH(ETHERNETx));

    ETHERNETx->ETH_MAC_T = MacAddr[0];
    ETHERNETx->ETH_MAC_M = MacAddr[1];
    ETHERNETx->ETH_MAC_H = MacAddr[2];
}

/**
  * @brief  Get the selected MAC address.
  * @param  ETHERNETx: Select the ETHERNET peripheral.
  *         This parameter should be MDR_ETHERNET1.
  * @param  MacAddr: Pointer on MAC address buffer data (6 bytes) to return.
  * @retval None
  */
void ETH_GetMACAddress(MDR_ETHERNET_TypeDef * ETHERNETx, uint16_t *MacAddr)
{
    /* Check the parameters */
    assert_param(IS_ETH_ALL_PERIPH(ETHERNETx));

    MacAddr[0] = ETHERNETx->ETH_MAC_T;
    MacAddr[1] = ETHERNETx->ETH_MAC_M;
    MacAddr[2] = ETHERNETx->ETH_MAC_H;
}

/**
  * @brief  Checks whether the specified ETHERNET MAC flag is set or not.
  * @param  ETHERNETx: Select the ETHERNET peripheral.
  *         This parameter should be MDR_ETHERNET1.
  * @param  ETH_PHY_FLAG: specifies the flag to check.
  *         This parameter can be one of the @ref ETH_PHY_FLAGx values.
  * @retval @ref FlagStatus - The state of ETHERNET PHY flag (SET or RESET).
  */
FlagStatus ETH_GetPHYStatus(MDR_ETHERNET_TypeDef * ETHERNETx, uint16_t ETH_PHY_FLAG)
{
    FlagStatus bitstatus;

    /* Check the parameters */
    assert_param(IS_ETH_ALL_PERIPH(ETHERNETx));
    assert_param(IS_ETH_PHY_FLAG(ETH_PHY_FLAG));

    if(ETHERNETx->PHY_Status & ETH_PHY_FLAG)
    {
       bitstatus = SET;
    }
    else
    {
       bitstatus = RESET;
    }

    return (bitstatus);
}

/**
  * @brief  Read a PHY register.
  * @param  ETHERNETx: Select the ETHERNET peripheral.
  *         This parameter should be MDR_ETHERNET1.
  * @param  PHYAddress: PHY device address, is the index of one of supported 32 PHY devices.
  *         This parameter can be one of the following values: 0,..,31
  * @param  PHYReg: PHY register address, is the index of one of the 32 PHY register.
  *         This parameter can be one of the @ref ETH_PHY_Reg_Addr values.
  * @retval ERROR: in case of timeout (@ref ErrorStatus).
  *         MAC register value: Data read from the selected PHY register (correct read).
  */
uint16_t ETH_ReadPHYRegister(MDR_ETHERNET_TypeDef * ETHERNETx, uint16_t PHYAddress, ETH_PHY_Reg_Addr PHYReg)
{
    uint32_t tmpreg = 0;
    __IO uint32_t timeout = 0;

    /* Check the parameters */
    assert_param(IS_ETH_ALL_PERIPH(ETHERNETx));
    assert_param(IS_ETH_PHY_ADDRESS(PHYAddress));
    assert_param(IS_ETH_PHYReg(PHYReg));

    /* Get the ETHERNET MACMIIAR value */
    tmpreg = ETHERNETx->ETH_MDIO_CTRL;
    /* Keep only the CSR Clock Range CR[2:0] bits value */
    tmpreg &= ETH_MDIO_CTRL_DIV_Msk;
    /* Prepare the MII address register value */
    tmpreg |= (uint32_t)(PHYAddress << 8) | (PHYReg << 0) | (1 << ETH_MDIO_CTRL_OP_Pos)
            | (1 << ETH_MDIO_CTRL_RDY_Pos) | (1 << ETH_MDIO_CTRL_PRE_EN_Pos) | (1 << 5);
    /* Write the result value into the MDIO_CTRL register */
    ETHERNETx->ETH_MDIO_CTRL = tmpreg;
    do {
        timeout++;
        tmpreg = ETHERNETx->ETH_MDIO_CTRL;
    } while(((tmpreg & ETH_MDIO_CTRL_RDY) == 0 ) && (timeout < PHY_READ_TO));

    /* Return ERROR in case of timeout */
    if(timeout == PHY_READ_TO)
    {
       return ((uint16_t)ERROR);
    }

    /* Return data register value */
    return ((uint16_t)ETHERNETx->ETH_MDIO_DATA);
}

/**
  * @brief  Write to a PHY register.
  * @param  ETHERNETx: Select the ETHERNET peripheral.
  *         This parameter should be MDR_ETHERNET1.
  * @param  PHYAddress: PHY device address, is the index of one of supported 32 PHY devices.
  *         This parameter can be one of the following values: 0,..,31.
  * @param  PHYReg: PHY register address, is the index of one of the 32 PHY register.
  *         This parameter can be one of the @ref ETH_PHY_Reg_Addr values.
  * @param  PHYValue: the value to write.
  * @retval @ref ErrorStatus - ERROR: in case of timeout; SUCCESS: for correct write.
  */
ErrorStatus ETH_WritePHYRegister(MDR_ETHERNET_TypeDef * ETHERNETx, uint16_t PHYAddress, ETH_PHY_Reg_Addr PHYReg, uint16_t PHYValue)
{
    uint32_t tmpreg = 0;
    __IO uint32_t timeout = 0;

    /* Check the parameters */
    assert_param(IS_ETH_ALL_PERIPH(ETHERNETx));
    assert_param(IS_ETH_PHY_ADDRESS(PHYAddress));
    assert_param(IS_ETH_PHYReg(PHYReg));

    /* Get the ETHERNET MACMIIAR value */
    tmpreg = ETHERNETx->ETH_MDIO_CTRL;

    /* Keep only the CSR Clock Range CR[2:0] bits value */
    tmpreg &= ~ETH_MDIO_CTRL_DIV_Msk;

    tmpreg &= ~(1 << ETH_MDIO_CTRL_OP_Pos);

    /* Prepare the MII address register value */
    tmpreg |= (uint32_t)(PHYAddress << 8) | (PHYReg << 0) | (1 << ETH_MDIO_CTRL_RDY_Pos) | (1 << ETH_MDIO_CTRL_PRE_EN_Pos) | (1 << 5);

    /* Give the value to the MII data register */
    ETHERNETx->ETH_MDIO_DATA = PHYValue;

    /* Write the result value into the MDIO_CTRL register */
    ETHERNETx->ETH_MDIO_CTRL = tmpreg;

    do {
        timeout++;
        tmpreg = ETHERNETx->ETH_MDIO_CTRL;
    } while(((tmpreg & ETH_MDIO_CTRL_RDY) == 0 ) && (timeout < PHY_READ_TO));

